tap "github/gh"
tap 'neovim/neovim'

brew "autojump"
brew "bat"
brew "brew-cask-completion"
brew "docker"
brew "fd"
brew "fnm"
brew "fzf"
brew "git"
brew "ripgrep"
brew "httpie"
brew "jq"
brew "mas"
brew "neovim"
brew "openssl"

cask_args appdir: "/Applications"
cask "karabiner-elements"
cask "warp"
