tap "github/gh"
tap 'neovim/neovim'

brew "autojump"
brew "bat"
brew "brew-cask-completion"
brew "eslint"
brew "git"
brew "httpie"
brew "jq"
brew "neovim"
brew "pnpm"
brew "prettier"

brew "docker"
brew "mas"
brew "openssl"

cask_args appdir: "/Applications"
cask "karabiner-elements"
cask "warp"