tap "github/gh"
tap 'neovim/neovim'

brew "autojump"
brew "bat"
brew "brew-cask-completion"
brew "docker"
brew "fd"
brew "fnm"
brew "fzf"
brew "git"
brew "ripgrep"
brew "httpie"
brew "jq"
brew "mas"
brew "mise"
brew "neovim"
brew "openssl"
brew "pnpm"
brew "postgresql@15"
brew "rbenv"
brew "starship"
brew "tmux"

cask_args appdir: "/Applications"
cask "karabiner-elements"
cask "warp"
cask "ghostty"
cask "zed@preview"
cask "font-hack-nerd-font"
