tap "github/gh"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap 'neovim/neovim'

brew "autojump"
brew "bat"
brew "brew-cask-completion"
brew "chezmoi"
brew "eslint"
brew "git"
brew "git-delta"
brew "httpie"
brew "jc"
brew "jq"
brew "n"
brew "neovim"
brew "pnpm"
brew "prettier"
brew "zplug"
brew "zsh-completions"

{{ if .macos -}}
brew "docker"
brew "mas"
brew "openssl"

cask_args appdir: "/Applications"
cask "1password"
cask "karabiner-elements"
cask "visual-studio-code"
cask "warp"


mas "CopyClip", id: 1020812363
mas "Divvy", id: 413857545
{{ end -}}